Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/include/component/dmac.h
/* -------- DMAC_CRCCHKSUM : (DMAC Offset: 0x08) (R/W 32) CRC Checksum -------- */
#define DMAC_CRCCHKSUM_RESETVALUE             _UINT32_(0x00)                                       /*  (DMAC_CRCCHKSUM) CRC Checksum  Reset Value */

#define DMAC_CRCCHKSUM_CRCCHKSUM_Pos          _UINT32_(0)                                          /* (DMAC_CRCCHKSUM) CRC Checksum Position */
#define DMAC_CRCCHKSUM_CRCCHKSUM_Msk          (_UINT32_(0xFFFFFFFF) << DMAC_CRCCHKSUM_CRCCHKSUM_Pos) /* (DMAC_CRCCHKSUM) CRC Checksum Mask */
#define DMAC_CRCCHKSUM_CRCCHKSUM(value)       (DMAC_CRCCHKSUM_CRCCHKSUM_Msk & (_UINT32_(value) << DMAC_CRCCHKSUM_CRCCHKSUM_Pos)) /* Assigment of value for CRCCHKSUM in the DMAC_CRCCHKSUM register */
#define DMAC_CRCCHKSUM_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (DMAC_CRCCHKSUM) Register Mask  */


/* -------- DMAC_CRCCTRL : (DMAC Offset: 0x02) (R/W 16) CRC Control -------- */
#define DMAC_CRCCTRL_RESETVALUE               _UINT16_(0x00)                                       /*  (DMAC_CRCCTRL) CRC Control  Reset Value */

#define DMAC_CRCCTRL_CRCBEATSIZE_Pos          _UINT16_(0)                                          /* (DMAC_CRCCTRL) CRC Beat Size Position */
#define DMAC_CRCCTRL_CRCBEATSIZE_Msk          (_UINT16_(0x3) << DMAC_CRCCTRL_CRCBEATSIZE_Pos)      /* (DMAC_CRCCTRL) CRC Beat Size Mask */
#define DMAC_CRCCTRL_CRCBEATSIZE(value)       (DMAC_CRCCTRL_CRCBEATSIZE_Msk & (_UINT16_(value) << DMAC_CRCCTRL_CRCBEATSIZE_Pos)) /* Assigment of value for CRCBEATSIZE in the DMAC_CRCCTRL register */
#define   DMAC_CRCCTRL_CRCBEATSIZE_BYTE_Val   _UINT16_(0x0)                                        /* (DMAC_CRCCTRL) 8-bit bus transfer  */
#define   DMAC_CRCCTRL_CRCBEATSIZE_HWORD_Val  _UINT16_(0x1)                                        /* (DMAC_CRCCTRL) 16-bit bus transfer  */
#define   DMAC_CRCCTRL_CRCBEATSIZE_WORD_Val   _UINT16_(0x2)                                        /* (DMAC_CRCCTRL) 32-bit bus transfer  */
#define DMAC_CRCCTRL_CRCBEATSIZE_BYTE         (DMAC_CRCCTRL_CRCBEATSIZE_BYTE_Val << DMAC_CRCCTRL_CRCBEATSIZE_Pos) /* (DMAC_CRCCTRL) 8-bit bus transfer Position  */
#define DMAC_CRCCTRL_CRCBEATSIZE_HWORD        (DMAC_CRCCTRL_CRCBEATSIZE_HWORD_Val << DMAC_CRCCTRL_CRCBEATSIZE_Pos) /* (DMAC_CRCCTRL) 16-bit bus transfer Position  */
#define DMAC_CRCCTRL_CRCBEATSIZE_WORD         (DMAC_CRCCTRL_CRCBEATSIZE_WORD_Val << DMAC_CRCCTRL_CRCBEATSIZE_Pos) /* (DMAC_CRCCTRL) 32-bit bus transfer Position  */
#define DMAC_CRCCTRL_CRCPOLY_Pos              _UINT16_(2)                                          /* (DMAC_CRCCTRL) CRC Polynomial Type Position */
#define DMAC_CRCCTRL_CRCPOLY_Msk              (_UINT16_(0x3) << DMAC_CRCCTRL_CRCPOLY_Pos)          /* (DMAC_CRCCTRL) CRC Polynomial Type Mask */
#define DMAC_CRCCTRL_CRCPOLY(value)           (DMAC_CRCCTRL_CRCPOLY_Msk & (_UINT16_(value) << DMAC_CRCCTRL_CRCPOLY_Pos)) /* Assigment of value for CRCPOLY in the DMAC_CRCCTRL register */
#define   DMAC_CRCCTRL_CRCPOLY_CRC16_Val      _UINT16_(0x0)                                        /* (DMAC_CRCCTRL) CRC-16 (CRC-CCITT)  */
#define   DMAC_CRCCTRL_CRCPOLY_CRC32_Val      _UINT16_(0x1)                                        /* (DMAC_CRCCTRL) CRC32 (IEEE 802.3)  */
#define DMAC_CRCCTRL_CRCPOLY_CRC16            (DMAC_CRCCTRL_CRCPOLY_CRC16_Val << DMAC_CRCCTRL_CRCPOLY_Pos) /* (DMAC_CRCCTRL) CRC-16 (CRC-CCITT) Position  */
#define DMAC_CRCCTRL_CRCPOLY_CRC32            (DMAC_CRCCTRL_CRCPOLY_CRC32_Val << DMAC_CRCCTRL_CRCPOLY_Pos) /* (DMAC_CRCCTRL) CRC32 (IEEE 802.3) Position  */
#define DMAC_CRCCTRL_CRCSRC_Pos               _UINT16_(8)                                          /* (DMAC_CRCCTRL) CRC Input Source Position */
#define DMAC_CRCCTRL_CRCSRC_Msk               (_UINT16_(0x3F) << DMAC_CRCCTRL_CRCSRC_Pos)          /* (DMAC_CRCCTRL) CRC Input Source Mask */
#define DMAC_CRCCTRL_CRCSRC(value)            (DMAC_CRCCTRL_CRCSRC_Msk & (_UINT16_(value) << DMAC_CRCCTRL_CRCSRC_Pos)) /* Assigment of value for CRCSRC in the DMAC_CRCCTRL register */
#define   DMAC_CRCCTRL_CRCSRC_DISABLE_Val     _UINT16_(0x0)                                        /* (DMAC_CRCCTRL) CRC Disabled  */
#define   DMAC_CRCCTRL_CRCSRC_IO_Val          _UINT16_(0x1)                                        /* (DMAC_CRCCTRL) I/O interface  */
#define   DMAC_CRCCTRL_CRCSRC_CHN0_Val        _UINT16_(0x20)                                       /* (DMAC_CRCCTRL) DMA Channel 0  */
#define   DMAC_CRCCTRL_CRCSRC_CHN1_Val        _UINT16_(0x21)                                       /* (DMAC_CRCCTRL) DMA Channel 1  */
#define   DMAC_CRCCTRL_CRCSRC_CHN2_Val        _UINT16_(0x22)                                       /* (DMAC_CRCCTRL) DMA Channel 2  */
#define   DMAC_CRCCTRL_CRCSRC_CHN3_Val        _UINT16_(0x23)                                       /* (DMAC_CRCCTRL) DMA Channel 3  */
#define   DMAC_CRCCTRL_CRCSRC_CHN4_Val        _UINT16_(0x24)                                       /* (DMAC_CRCCTRL) DMA Channel 4  */
#define   DMAC_CRCCTRL_CRCSRC_CHN5_Val        _UINT16_(0x25)                                       /* (DMAC_CRCCTRL) DMA Channel 5  */
#define   DMAC_CRCCTRL_CRCSRC_CHN6_Val        _UINT16_(0x26)                                       /* (DMAC_CRCCTRL) DMA Channel 6  */
#define   DMAC_CRCCTRL_CRCSRC_CHN7_Val        _UINT16_(0x27)                                       /* (DMAC_CRCCTRL) DMA Channel 7  */
#define   DMAC_CRCCTRL_CRCSRC_CHN8_Val        _UINT16_(0x28)                                       /* (DMAC_CRCCTRL) DMA Channel 8  */
#define   DMAC_CRCCTRL_CRCSRC_CHN9_Val        _UINT16_(0x29)                                       /* (DMAC_CRCCTRL) DMA Channel 9  */
#define   DMAC_CRCCTRL_CRCSRC_CHN10_Val       _UINT16_(0x2A)                                       /* (DMAC_CRCCTRL) DMA Channel 10  */
#define   DMAC_CRCCTRL_CRCSRC_CHN11_Val       _UINT16_(0x2B)                                       /* (DMAC_CRCCTRL) DMA Channel 11  */
#define   DMAC_CRCCTRL_CRCSRC_CHN12_Val       _UINT16_(0x2C)                                       /* (DMAC_CRCCTRL) DMA Channel 12  */
#define   DMAC_CRCCTRL_CRCSRC_CHN13_Val       _UINT16_(0x2D)                                       /* (DMAC_CRCCTRL) DMA Channel 13  */
#define   DMAC_CRCCTRL_CRCSRC_CHN14_Val       _UINT16_(0x2E)                                       /* (DMAC_CRCCTRL) DMA Channel 14  */
#define   DMAC_CRCCTRL_CRCSRC_CHN15_Val       _UINT16_(0x2F)                                       /* (DMAC_CRCCTRL) DMA Channel 15  */
#define   DMAC_CRCCTRL_CRCSRC_CHN16_Val       _UINT16_(0x30)                                       /* (DMAC_CRCCTRL) DMA Channel 16  */
#define   DMAC_CRCCTRL_CRCSRC_CHN17_Val       _UINT16_(0x31)                                       /* (DMAC_CRCCTRL) DMA Channel 17  */
#define   DMAC_CRCCTRL_CRCSRC_CHN18_Val       _UINT16_(0x32)                                       /* (DMAC_CRCCTRL) DMA Channel 18  */
#define   DMAC_CRCCTRL_CRCSRC_CHN19_Val       _UINT16_(0x33)                                       /* (DMAC_CRCCTRL) DMA Channel 19  */
#define   DMAC_CRCCTRL_CRCSRC_CHN20_Val       _UINT16_(0x34)                                       /* (DMAC_CRCCTRL) DMA Channel 20  */
#define   DMAC_CRCCTRL_CRCSRC_CHN21_Val       _UINT16_(0x35)                                       /* (DMAC_CRCCTRL) DMA Channel 21  */
#define   DMAC_CRCCTRL_CRCSRC_CHN22_Val       _UINT16_(0x36)                                       /* (DMAC_CRCCTRL) DMA Channel 22  */
#define   DMAC_CRCCTRL_CRCSRC_CHN23_Val       _UINT16_(0x37)                                       /* (DMAC_CRCCTRL) DMA Channel 23  */
#define   DMAC_CRCCTRL_CRCSRC_CHN24_Val       _UINT16_(0x38)                                       /* (DMAC_CRCCTRL) DMA Channel 24  */
#define   DMAC_CRCCTRL_CRCSRC_CHN25_Val       _UINT16_(0x39)                                       /* (DMAC_CRCCTRL) DMA Channel 25  */
#define   DMAC_CRCCTRL_CRCSRC_CHN26_Val       _UINT16_(0x3A)                                       /* (DMAC_CRCCTRL) DMA Channel 26  */
#define   DMAC_CRCCTRL_CRCSRC_CHN27_Val       _UINT16_(0x3B)                                       /* (DMAC_CRCCTRL) DMA Channel 27  */
#define   DMAC_CRCCTRL_CRCSRC_CHN28_Val       _UINT16_(0x3C)                                       /* (DMAC_CRCCTRL) DMA Channel 28  */
#define   DMAC_CRCCTRL_CRCSRC_CHN29_Val       _UINT16_(0x3D)                                       /* (DMAC_CRCCTRL) DMA Channel 29  */
#define   DMAC_CRCCTRL_CRCSRC_CHN30_Val       _UINT16_(0x3E)                                       /* (DMAC_CRCCTRL) DMA Channel 30  */
#define   DMAC_CRCCTRL_CRCSRC_CHN31_Val       _UINT16_(0x3F)                                       /* (DMAC_CRCCTRL) DMA Channel 31  */
#define DMAC_CRCCTRL_CRCSRC_DISABLE           (DMAC_CRCCTRL_CRCSRC_DISABLE_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) CRC Disabled Position  */
#define DMAC_CRCCTRL_CRCSRC_IO                (DMAC_CRCCTRL_CRCSRC_IO_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) I/O interface Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN0              (DMAC_CRCCTRL_CRCSRC_CHN0_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 0 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN1              (DMAC_CRCCTRL_CRCSRC_CHN1_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 1 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN2              (DMAC_CRCCTRL_CRCSRC_CHN2_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 2 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN3              (DMAC_CRCCTRL_CRCSRC_CHN3_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 3 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN4              (DMAC_CRCCTRL_CRCSRC_CHN4_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 4 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN5              (DMAC_CRCCTRL_CRCSRC_CHN5_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 5 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN6              (DMAC_CRCCTRL_CRCSRC_CHN6_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 6 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN7              (DMAC_CRCCTRL_CRCSRC_CHN7_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 7 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN8              (DMAC_CRCCTRL_CRCSRC_CHN8_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 8 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN9              (DMAC_CRCCTRL_CRCSRC_CHN9_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 9 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN10             (DMAC_CRCCTRL_CRCSRC_CHN10_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 10 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN11             (DMAC_CRCCTRL_CRCSRC_CHN11_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 11 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN12             (DMAC_CRCCTRL_CRCSRC_CHN12_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 12 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN13             (DMAC_CRCCTRL_CRCSRC_CHN13_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 13 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN14             (DMAC_CRCCTRL_CRCSRC_CHN14_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 14 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN15             (DMAC_CRCCTRL_CRCSRC_CHN15_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 15 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN16             (DMAC_CRCCTRL_CRCSRC_CHN16_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 16 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN17             (DMAC_CRCCTRL_CRCSRC_CHN17_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 17 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN18             (DMAC_CRCCTRL_CRCSRC_CHN18_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 18 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN19             (DMAC_CRCCTRL_CRCSRC_CHN19_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 19 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN20             (DMAC_CRCCTRL_CRCSRC_CHN20_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 20 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN21             (DMAC_CRCCTRL_CRCSRC_CHN21_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 21 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN22             (DMAC_CRCCTRL_CRCSRC_CHN22_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 22 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN23             (DMAC_CRCCTRL_CRCSRC_CHN23_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 23 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN24             (DMAC_CRCCTRL_CRCSRC_CHN24_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 24 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN25             (DMAC_CRCCTRL_CRCSRC_CHN25_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 25 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN26             (DMAC_CRCCTRL_CRCSRC_CHN26_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 26 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN27             (DMAC_CRCCTRL_CRCSRC_CHN27_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 27 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN28             (DMAC_CRCCTRL_CRCSRC_CHN28_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 28 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN29             (DMAC_CRCCTRL_CRCSRC_CHN29_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 29 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN30             (DMAC_CRCCTRL_CRCSRC_CHN30_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 30 Position  */
#define DMAC_CRCCTRL_CRCSRC_CHN31             (DMAC_CRCCTRL_CRCSRC_CHN31_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) DMA Channel 31 Position  */
#define DMAC_CRCCTRL_CRCMODE_Pos              _UINT16_(14)                                         /* (DMAC_CRCCTRL) CRC Operating Mode Position */
#define DMAC_CRCCTRL_CRCMODE_Msk              (_UINT16_(0x3) << DMAC_CRCCTRL_CRCMODE_Pos)          /* (DMAC_CRCCTRL) CRC Operating Mode Mask */
#define DMAC_CRCCTRL_CRCMODE(value)           (DMAC_CRCCTRL_CRCMODE_Msk & (_UINT16_(value) << DMAC_CRCCTRL_CRCMODE_Pos)) /* Assigment of value for CRCMODE in the DMAC_CRCCTRL register */
#define   DMAC_CRCCTRL_CRCMODE_DEFAULT_Val    _UINT16_(0x0)                                        /* (DMAC_CRCCTRL) Default operating mode  */
#define   DMAC_CRCCTRL_CRCMODE_CRCMON_Val     _UINT16_(0x2)                                        /* (DMAC_CRCCTRL) Memory CRC monitor operating mode  */
#define   DMAC_CRCCTRL_CRCMODE_CRCGEN_Val     _UINT16_(0x3)                                        /* (DMAC_CRCCTRL) Memory CRC generation operating mode  */
#define DMAC_CRCCTRL_CRCMODE_DEFAULT          (DMAC_CRCCTRL_CRCMODE_DEFAULT_Val << DMAC_CRCCTRL_CRCMODE_Pos) /* (DMAC_CRCCTRL) Default operating mode Position  */
#define DMAC_CRCCTRL_CRCMODE_CRCMON           (DMAC_CRCCTRL_CRCMODE_CRCMON_Val << DMAC_CRCCTRL_CRCMODE_Pos) /* (DMAC_CRCCTRL) Memory CRC monitor operating mode Position  */
#define DMAC_CRCCTRL_CRCMODE_CRCGEN           (DMAC_CRCCTRL_CRCMODE_CRCGEN_Val << DMAC_CRCCTRL_CRCMODE_Pos) /* (DMAC_CRCCTRL) Memory CRC generation operating mode Position  */
#define DMAC_CRCCTRL_Msk                      _UINT16_(0xFF0F)                                     /* (DMAC_CRCCTRL) Register Mask  */


